tap "homebrew/bundle"
tap "homebrew/core"

brew "bat"
brew "fd"
brew "go-task"
brew "gomplate"
brew "fzf"
brew "jq"
brew "tldr"
brew "delta"
brew "ripgrep"
brew "zoxide"
brew "eza"
brew "thefuck"
brew "lazygit"
brew "dive"
brew "croc"
brew "zsh-autosuggestions"
brew "navi"