tap "homebrew/bundle"

brew "age"
brew "byobu"
brew "midnight-commander"
brew "step"
brew "dotenvx/brew/dotenvx"

brew "bat"
brew "fd"
brew "go-task"
brew "gomplate"
brew "fzf"
brew "jq"
brew "tldr"
brew "delta"
brew "ripgrep"
brew "zoxide"
brew "eza"
brew "thefuck"
brew "lazygit"
brew "dive"
brew "croc"
brew "zsh-autosuggestions"
brew "navi"

# From reference: https://github.com/arcticicestudio/igloo

brew "awscli"
brew "cmake"
brew "coreutils"
brew "diffutils"
brew "e2fsprogs"
brew "e2tools"
brew "ext4fuse"
# brew "ffmpeg", args: ["with-fdk-aac", "with-fontconfig", "with-freetype", "with-frei0r", "with-libass", "with-libbluray", "with-libgsm", "with-librsvg", "with-libsoxr", "with-libssh", "with-libvidstab", "with-libvorbis", "with-libvpx", "with-opencore-amr", "with-openh264", "with-openjpeg", "with-openssl", "with-opus", "with-rtmpdump", "with-sdl2", "with-speex", "with-srt", "with-theora", "with-tools", "with-wavpack", "with-webp", "with-x265", "with-xz"]
brew "gpg"
brew "gzip"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "htop", args: ["with-ncurses"]
brew "ifuse"
# brew "imagemagick", args: ["with-fftw", "with-fontconfig", "with-hdri", "with-libheif", "with-libqr", "with-librsvg", "with-libwmf", "with-little-cms", "with-little-cms2", "with-opencl", "with-openexr", "with-openjpeg", "with-openmp", "with-perl", "with-webp", "with-x11"]
# brew "imageoptim-cli"
brew "jq"
brew "make"
brew "neofetch"
brew "nmap"
brew "ntfs-3g"
# brew "python2"
brew "rsync"
brew "sqlite"
brew "webp"
brew "woff2"

# cask "balsamiq-wireframes"
cask "numi"
cask "wezterm"
cask "notion-calendar"
cask "postman"

# vscode extensions
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
# vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
