tap "homebrew/bundle"

brew "ack"
brew "age"
brew "byobu"
brew "midnight-commander"
brew "step"

brew "bat"
brew "fd"
brew "go-task"
brew "gomplate"
brew "fzf"
brew "jq"
brew "tldr"
brew "delta"
brew "ripgrep"
brew "zoxide"
brew "eza"
brew "thefuck"
brew "lazygit"
brew "dive"
brew "croc"

# cask "balsamiq-wireframes"
cask "numi"
cask "wezterm"
cask "notion-calendar"

# vscode extensions
vscode "codezombiech.gitignore"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
# vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "foxundermoon.shell-format"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
